In [1]:
import pandas as pd
import sqlite3
import os

In [2]:
os.getcwd()

'c:\\Users\\nsara\\Desktop\\naiara_thebridge\\2503_dsft_thebridge_naiara\\2-Data_Analysis\\8-BBDD\\SQL\\Practica\\1-Chinook'

In [3]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect(r"data/chinook.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [4]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [ ]:
# 1 Obtén los clientes de brasil
query = '''
SELECT * FROM customers
WHERE customers.Country = "Brazil";
'''

df = sql_query(query)
df

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
2,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
3,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4

In [33]:
# 2  Obtén los empleados que son agentes de ventas
query = '''
SELECT * FROM employees
WHERE title = "Sales Support Agent"
'''

df = sql_query(query)
df

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,3,Peacock,Jane,Sales Support Agent,2,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
1,4,Park,Margaret,Sales Support Agent,2,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
2,5,Johnson,Steve,Sales Support Agent,2,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [34]:
# 3 Obtén las canciones de ‘AC/DC’

query = '''
SELECT * FROM tracks 
WHERE Composer = "AC/DC";
'''

df = sql_query(query)
df

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,15,Go Down,4,1,1,AC/DC,331180,10847611,0.99
1,16,Dog Eat Dog,4,1,1,AC/DC,215196,7032162,0.99
2,17,Let There Be Rock,4,1,1,AC/DC,366654,12021261,0.99
3,18,Bad Boy Boogie,4,1,1,AC/DC,267728,8776140,0.99
4,19,Problem Child,4,1,1,AC/DC,325041,10617116,0.99
5,20,Overdose,4,1,1,AC/DC,369319,12066294,0.99
6,21,Hell Ain't A Bad Place To Be,4,1,1,AC/DC,254380,8331286,0.99
7,22,Whole Lotta Rosie,4,1,1,AC/DC,323761,10547154,0.99

In [35]:
# 4 Obtén los campos de los clientes que no sean de USA: Nombre completo, ID, País

query = '''
SELECT * FROM customers  
WHERE Country != 'USA';  
'''

df = sql_query(query)
df

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
2,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4
5,6,Helena,Holý,None,Rilská 3174/6,Prague,None,Czech Republic,14300,+420 2 4177 0449,None,hholy@gmail.com,5
6,7,Astrid,Gruber,None,"Rotenturmstraße 4, 1010 Innere Stadt",Vienne,None,Austria,1010,+43 01 5134505,None,astrid.gruber@apple.at,5
7,8,Daan,Peeters,None,Grétrystraat 63,Brussels,None,Belgium,1000,+32 02 219 03 03,None,daan_peeters@apple.be,4
8,9,Kara,Nielsen,None,Sønder Boulevard 51,Copenhagen,None,Denmark,1720,+453 3331 9991,None,kara.nielsen@jubii.dk,4
9,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
10,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
11,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
12,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4
13,14,Mark,Philips,Telus,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,+1 (780) 434-4554,+1 (780) 434-5565,mphilips12@shaw.ca,5
14,15,Jennifer,Peterson,Rogers Canada,700 W Pender Street,Vancouver,BC,Canada,V6C 1G8,+1 (604) 688-2255,+1 (604) 688-8756,jenniferp@rogers.ca,3
15,29,Robert,Brown,None,796 Dundas Street West,Toronto,ON,Canada,M6J 1V1,+1 (416) 363-8888,None,robbrown@shaw.ca,3
16,30,Edward,Francis,None,230 Elgin Street,Ottawa,ON,Canada,K2P 1L7,+1 (613) 234-3322,None,edfrancis@yachoo.ca,3
17,31,Martha,Silk,None,194A Chain Lake Drive,Halifax,NS,Canada,B3S 1C5,+1 (902) 450-0450,None,marthasilk@gmail.com,5
18,32,Aaron,Mitchell,None,696 Osborne Street,Winnipeg,MB,Canada,R3L 2B9,+1 (204) 452-6452,None,aaronmitchell@yahoo.ca,4
19,33,Ellie,Sullivan,None,5112 48 Street,Yellowknife,NT,Canada,X1A 1N6,+1 (867) 920-2233,None,ellie.sullivan@shaw.ca,3
20,34,João,Fernandes,None,Rua da Assunção 53,Lisbon,None,Portugal,None,+351 (213) 466-111,None,jfernandes@yahoo.pt,4
21,35,Madalena,Sampaio,None,"Rua dos Campeões Europeus de Viena, 4350",Porto,None,Portugal,None,+351 (225) 022-448,None,masampaio@sapo.pt,4
22,36,Hannah,Schneider,None,Tauentzienstraße 8,Berlin,None,Germany,10789,+49 030 26550280,None,hannah.schneider@yahoo.de,5
23,37,Fynn,Zimmermann,None,Berger Straße 10,Frankfurt,None,Germany,60316,+49 069 40598889,None,fzimmermann@yahoo.de,3
24,38,Niklas,Schröder,None,Barbarossastraße 19,Berlin,None,Germany,10779,+49 030 2141444,None,nschroder@surfeu.de,3
25,39,Camille,Bernard,None,"4, Rue Milton",Paris,None,France,75009,+33 01 49 70 65 65,None,camille.bernard@yahoo.fr,4
26,40,Dominique,Lefebvre,None,"8, Rue Hanovre",Paris,None,France,75002,+33 01 47 42 71 71,None,dominiquelefebvre@gmail.com,4
27,41,Marc,Dubois,None,"11, Place Bellecour",Lyon,None,France,69002,+33 04 78 30 30 30,None,marc.dubois@hotmail.com,5
28,42,Wyatt,Girard,None,"9, Place Louis Barthou",Bordeaux,None,France,33000,+33 05 56 96 96 96,None,wyatt.girard@yahoo.fr,3
29,43,Isabelle,Mercier,None,"68, Rue Jouvence",Dijon,None,France,21000,+33 03 80 73 66 99,None,isabelle_mercier@apple.fr,3
30,44,Terhi,Hämäläinen,None,Porthaninkatu 9,Helsinki,None,Finland,00530,+358 09 870 2000,None,terhi.hamalainen@apple.fi,3
31,45,Ladislav,Kovács,None,Erzsébet krt. 58.,Budapest,None,Hungary,H-1073,None,None,ladislav_kovacs@apple.hu,3
32,46,Hugh,O'Reilly,None,3 Chatham Street,Dublin,Dublin,Ireland,None,+353 01 6792424,None,hughoreilly@apple.ie,3
33,47,Lucas,Mancini,None,"Via Degli Scipioni, 43",Rome,RM,Italy,00192,+39 06 39733434,None,lucas.mancini@yahoo.it,5
34,48,Johannes,Van der Berg,None,Lijnbaansgracht 120bg,Amsterdam,VV,Netherlands,1016,+31 020 6223130,None,johavanderberg@yahoo.nl,5
35,49,Stanisław,Wójcik,None,Ordynacka 10,Warsaw,None,Poland,00-358,+48 22 828 37 39,None,stanisław.wójcik@wp.pl,4
36,50,Enrique,Muñoz,None,C/ San Bernardo 85,Madrid,None,Spain,28015,+34 914 454 454,None,enrique_munoz@yahoo.es,5
37,51,Joakim,Johansson,None,Celsiusg. 9,Stockholm,None,Sweden,11230,+46 08-651 52 52,None,joakim.johansson@yahoo.se,5
38,52,Emma,Jones,None,202 Hoxton Street,London,None,United Kingdom,N1 5LH,+44 020 7707 0707,None,emma_jones@hotmail.com,3
39,53,Phil,Hughes,None,113 Lupus St,London,None,United Kingdom,SW1V 3EN,+44 020 7976 5722,None,phil.hughes@gmail.com,3
40,54,Steve,Murray,None,110 Raeburn Pl,Edinburgh,None,United Kingdom,EH4 1HH,+44 0131 315 3300,None,steve.murray@yahoo.uk,5
41,55,Mark,Taylor,None,421 Bourke Street,Sidney,NSW,Australia,2010,+61 (02) 9332 3633,None,mark.taylor@yahoo.au,4
42,56,Diego,Gutiérrez,None,307 Macacha Güemes,Buenos Aires,None,Argentina,1106,+54 (0)11 4311 4333,None,diego.gutierrez@yahoo.ar,4
43,57,Luis,Rojas,None,"Calle Lira, 198",Santiago,None,Chile,None,+56 (0)2 635 4444,None,luisrojas@yahoo.cl,5
44,58,Manoj,Pareek,None,"12,Community Centre",Delhi,None,India,110017,+91 0124 39883988,None,manoj.pareek@rediff.com,3
45,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,None,puja_srivastava@yahoo.in,3

In [36]:
# 5 Obtén los empleados que son agentes de ventas: Nombre completo, Dirección (Ciudad, Estado, País) y email

query = '''
SELECT * FROM employees  
WHERE Title = "Sales Support Agent";  
'''

df = sql_query(query)
df

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,3,Peacock,Jane,Sales Support Agent,2,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
1,4,Park,Margaret,Sales Support Agent,2,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
2,5,Johnson,Steve,Sales Support Agent,2,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [37]:
# 6 Obtén una lista con los países no repetidos a los que se han emitido facturas

query = '''
SELECT DISTINCT BillingCountry
FROM invoices;
'''

df = sql_query(query)
df

    BillingCountry
0          Germany
1           Norway
2          Belgium
3           Canada
4              USA
5           France
6          Ireland
7   United Kingdom
8        Australia
9            Chile
10           India
11          Brazil
12        Portugal
13     Netherlands
14           Spain
15          Sweden
16  Czech Republic
17         Finland
18         Denmark
19           Italy
20          Poland
21         Austria
22         Hungary
23       Argentina

In [38]:
# 7 Obtén una lista con los estados de USA no repetidos de donde son los clientes y cuántos clientes en cada uno.
# revisar
query = '''
SELECT State, COUNT(*) AS NumberOfCustomers
FROM customers  
WHERE Country = 'USA'  
GROUP BY State;

'''

df = sql_query(query)
df

   State  NumberOfCustomers
0     AZ                  1
1     CA                  3
2     FL                  1
3     IL                  1
4     MA                  1
5     NV                  1
6     NY                  1
7     TX                  1
8     UT                  1
9     WA                  1
10    WI                  1

In [39]:
# 8 Cuántos artículos tiene la factura 37

query = '''
SELECT invoiceId, COUNT (*) AS Quantity FROM invoice_items
WHERE InvoiceId = 37
'''

df = sql_query(query)
df

   InvoiceId  Quantity
0         37         4

In [40]:
## TODO
# 9 Cuántas canciones tiene ‘AC/DC’

query = '''
SELECT invoiceId, COUNT (*) AS Quantity FROM invoice_items
WHERE InvoiceId = 37
'''

df = sql_query(query)
df

   InvoiceId  Quantity
0         37         4

In [41]:
# 10. Cuántos artículos tiene cada factura

query = '''
SELECT InvoiceId, COUNT(*) AS Quantity  
FROM invoice_items  
GROUP BY InvoiceId;
'''

df = sql_query(query)
df

     InvoiceId  Quantity
0            1         2
1            2         4
2            3         6
3            4         9
4            5        14
..         ...       ...
407        408         4
408        409         6
409        410         9
410        411        14
411        412         1

[412 rows x 2 columns]

In [42]:
# 11. Cuántas facturas hay de cada país

query = '''
SELECT BillingCountry, COUNT(*) AS Quantity  
FROM invoices  
GROUP BY BillingCountry;
'''

df = sql_query(query)
df

    BillingCountry  Quantity
0        Argentina         7
1        Australia         7
2          Austria         7
3          Belgium         7
4           Brazil        35
5           Canada        56
6            Chile         7
7   Czech Republic        14
8          Denmark         7
9          Finland         7
10          France        35
11         Germany        28
12         Hungary         7
13           India        13
14         Ireland         7
15           Italy         7
16     Netherlands         7
17          Norway         7
18          Poland         7
19        Portugal        14
20           Spain         7
21          Sweden         7
22             USA        91
23  United Kingdom        21

In [43]:
#  12. Cuántas facturas ha habido en 2009 y 2011

query = '''
SELECT strftime("%Y", InvoiceDate) AS YEAR, COUNT (*) AS TOTAL_CLIENTS FROM invoices
WHERE (strftime("%Y", InvoiceDate) = "2009") OR (strftime("%Y", InvoiceDate) = "2011")
GROUP BY YEAR

'''

df = sql_query(query)
df

   YEAR  TOTAL_CLIENTS
0  2009             83
1  2011             83

In [44]:
# 13. Cuántas facturas ha habido entre 2009 y 2011

query = '''
SELECT strftime("%Y", InvoiceDate) AS YEAR, COUNT(*) AS TOTAL_CLIENTS  
FROM invoices  
WHERE strftime("%Y", InvoiceDate) BETWEEN "2009" AND "2011"  
GROUP BY YEAR;

'''

df = sql_query(query)
df

   YEAR  TOTAL_CLIENTS
0  2009             83
1  2010             83
2  2011             83

In [45]:
# 14. Cuántas clientes hay de España y de Brasil

query = '''
SELECT Country, COUNT(*) AS NumClients FROM customers  
WHERE Country IN ('Spain', 'Brazil')  
GROUP BY Country;

'''

df = sql_query(query)
df

  Country  NumClients
0  Brazil           5
1   Spain           1

In [46]:
# 15. Obtén las canciones que su título empieza por ‘You’

query = '''
SELECT Name AS Title FROM tracks  
WHERE Name LIKE "You%"

'''

df = sql_query(query)
df

                                            Title
0                                 You Oughta Know
1                                       You Learn
2                     You Oughta Know (Alternate)
3                              Your Time Has Come
4                                    You Shook Me
5                                 You Shook Me(2)
6                                 You Fool No One
7             You Fool No One (Alternate Version)
8                              You Keep On Moving
9   You Can't Do it Right (With the One You Love)
10                                   You're Crazy
11                            You Ain't the First
12                              You Could Be Mine
13                You've Got Another Thing Comin'
14                                   You Shook Me
15                        Your Time Is Gonna Come
16                 You've Been A Long Time Coming
17   You're What's Happening (In The World Today)
18                          You Sure Love To Ball
19                                 Your Blue Room
20                                        You Are
21                          You're My Best Friend
22                         You Are The Everything
23                                  You've Got It
24                                    Your Mirror
25                             You Got Me Rocking
26                             You Got Me Rocking
27                             You Better You Bet
28                              You Really Got Me
29                               You Got No Right
30               You're Gonna Break My Hart Again
31                        Your Time Is Gonna Come
32                                    Your Savior
33                                Your Soul Today
34                               You Know My Name
35                           You Know I'm No Good
36  You Know I'm No Good (feat. Ghostface Killah)
37                    You Sent Me Flying / Cherry

### SEGUNDA PARTE

In [ ]:
# 1. Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la 
# factura y el país de la factura

query = '''
SELECT i.InvoiceId, i.InvoiceDate, i.BillingCountry, c.FirstName
FROM Invoices i
JOIN Customers c ON i.CustomerId = c.CustomerId
WHERE c.Country = 'Brazil';
'''

df = sql_query(query)
df

    InvoiceId          InvoiceDate BillingCountry  FirstName
0          98  2010-03-11 00:00:00         Brazil       Luís
1         121  2010-06-13 00:00:00         Brazil       Luís
2         143  2010-09-15 00:00:00         Brazil       Luís
3         195  2011-05-06 00:00:00         Brazil       Luís
4         316  2012-10-27 00:00:00         Brazil       Luís
5         327  2012-12-07 00:00:00         Brazil       Luís
6         382  2013-08-07 00:00:00         Brazil       Luís
7          25  2009-04-09 00:00:00         Brazil    Eduardo
8         154  2010-11-14 00:00:00         Brazil    Eduardo
9         177  2011-02-16 00:00:00         Brazil    Eduardo
10        199  2011-05-21 00:00:00         Brazil    Eduardo
11        251  2012-01-09 00:00:00         Brazil    Eduardo
12        372  2013-07-02 00:00:00         Brazil    Eduardo
13        383  2013-08-12 00:00:00         Brazil    Eduardo
14         57  2009-09-06 00:00:00         Brazil  Alexandre
15         68  2009-10-17 00:00:00         Brazil  Alexandre
16        123  2010-06-17 00:00:00         Brazil  Alexandre
17        252  2012-01-22 00:00:00         Brazil  Alexandre
18        275  2012-04-25 00:00:00         Brazil  Alexandre
19        297  2012-07-28 00:00:00         Brazil  Alexandre
20        349  2013-03-18 00:00:00         Brazil  Alexandre
21         34  2009-05-23 00:00:00         Brazil    Roberto
22        155  2010-11-14 00:00:00         Brazil    Roberto
23        166  2010-12-25 00:00:00         Brazil    Roberto
24        221  2011-08-25 00:00:00         Brazil    Roberto
25        350  2013-03-31 00:00:00         Brazil    Roberto
26        373  2013-07-03 00:00:00         Brazil    Roberto
27        395  2013-10-05 00:00:00         Brazil    Roberto
28         35  2009-06-05 00:00:00         Brazil   Fernanda
29         58  2009-09-07 00:00:00         Brazil   Fernanda
30         80  2009-12-10 00:00:00         Brazil   Fernanda
31        132  2010-07-31 00:00:00         Brazil   Fernanda
32        253  2012-01-22 00:00:00         Brazil   Fernanda
33        264  2012-03-03 00:00:00         Brazil   Fernanda
34        319  2012-11-01 00:00:00         Brazil   Fernanda

In [11]:
#  2. Obtén cada factura asociada a cada agente de ventas con su nombre completo

query = '''
SELECT e.FirstName, e.LastName, i.InvoiceId
FROM Invoices i
JOIN Customers c ON i.CustomerId = c.CustomerId
JOIN Employees e ON c.SupportRepId = e.EmployeeId;
'''

df = sql_query(query)
df

    FirstName LastName  InvoiceId
0        Jane  Peacock         98
1        Jane  Peacock        121
2        Jane  Peacock        143
3        Jane  Peacock        195
4        Jane  Peacock        316
..        ...      ...        ...
407     Steve  Johnson         88
408     Steve  Johnson        217
409     Steve  Johnson        240
410     Steve  Johnson        262
411     Steve  Johnson        314

[412 rows x 3 columns]

In [14]:
# 3. Obtén el nombre del cliente, el país, el nombre del agente y el total

query = '''
SELECT c.FirstName, c.LastName, 
       c.Country, 
       e.FirstName, e.LastName, 
       i.Total
FROM Invoices i
JOIN Customers c ON i.CustomerId = c.CustomerId
JOIN Employees e ON c.SupportRepId = e.EmployeeId;
'''

df = sql_query(query)
df

    FirstName    LastName Country FirstName LastName  Total
0        Luís   Gonçalves  Brazil      Jane  Peacock   3.98
1        Luís   Gonçalves  Brazil      Jane  Peacock   3.96
2        Luís   Gonçalves  Brazil      Jane  Peacock   5.94
3        Luís   Gonçalves  Brazil      Jane  Peacock   0.99
4        Luís   Gonçalves  Brazil      Jane  Peacock   1.98
..        ...         ...     ...       ...      ...    ...
407      Puja  Srivastava   India      Jane  Peacock   5.94
408      Puja  Srivastava   India      Jane  Peacock   1.99
409      Puja  Srivastava   India      Jane  Peacock   1.98
410      Puja  Srivastava   India      Jane  Peacock  13.86
411      Puja  Srivastava   India      Jane  Peacock   8.91

[412 rows x 6 columns]

In [15]:
#  4. Obtén cada artículo de la factura con el nombre de la canción

query = '''
SELECT ii.InvoiceId, 
       t.Name AS Cancion, 
       ii.UnitPrice, 
       ii.Quantity
FROM Invoice_Items ii
JOIN Tracks t ON ii.TrackId = t.TrackId;

'''

df = sql_query(query)
df

,InvoiceId,Cancion,UnitPrice,Quantity
0,1,Balls to the Wall,0.99,1
1,1,Restless and Wild,0.99,1
2,2,Put The Finger On You,0.99,1
3,2,Inject The Venom,0.99,1
4,2,Evil Walks,0.99,1
...,...,...,...,...
2235,411,Looking For Love,0.99,1
2236,411,Sweet Lady Luck,0.99,1
2237,411,Feirinha da Pavuna/Luz do Repente/Bagaço da La...,0.99,1
2238,411,Samba pras moças,0.99,1
2239,412,Hot Girl,1.99,1

In [16]:
#  5. Muestra todas las canciones con su nombre, formato, álbum y género
query = '''
SELECT t.Name AS Cancion, 
       m.Name AS Formato, 
       a.Title AS Album, 
       g.Name AS Genero
FROM Tracks t
JOIN Media_Types m ON t.MediaTypeId = m.MediaTypeId
JOIN Albums a ON t.AlbumId = a.AlbumId
JOIN Genres g ON t.GenreId = g.GenreId;
'''

df = sql_query(query)
df

,Cancion,Formato,Album,Genero
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Protected AAC audio file,Mozart Gala: Famous Arias,Opera

In [22]:
# 6. Cuántas canciones hay en cada playlist

query = '''
SELECT p.Name AS Playlist, 
       COUNT(pt.TrackId) AS CantidadCanciones
FROM Playlists p
JOIN Playlist_Track pt ON p.PlaylistId = pt.PlaylistId
GROUP BY p.Name;
'''

df = sql_query(query)
df

                      Playlist  CantidadCanciones
0                   90’s Music               1477
1              Brazilian Music                 39
2                    Classical                 75
3    Classical 101 - Deep Cuts                 25
4   Classical 101 - Next Steps                 25
5   Classical 101 - The Basics                 25
6                       Grunge                 15
7          Heavy Metal Classic                 26
8                        Music               6580
9                 Music Videos                  1
10                 On-The-Go 1                  1
11                    TV Shows                426

In [23]:
#  7. Cuánto ha vendido cada empleado
query = '''
SELECT employees.FirstName || ' ' || employees.LastName AS empleado,
       SUM(invoices.total) AS total_vendido
FROM employees
JOIN customers ON employees.EmployeeId = customers.SupportRepId
JOIN invoices ON customers.customerId = invoices.CustomerId
GROUP BY employees.EmployeeId;

'''

df = sql_query(query)
df

        empleado  total_vendido
0   Jane Peacock         833.04
1  Margaret Park         775.40
2  Steve Johnson         720.16

In [24]:
# 8. ¿Quién ha sido el agente de ventas que más ha vendido en 2009?

query = '''
SELECT employees.FirstName || ' ' || employees.LastName AS Empleado,
       SUM(invoices.Total) AS TotalVendido
FROM employees
JOIN customers ON employees.EmployeeId = customers.SupportRepId
JOIN invoices ON customers.CustomerId = invoices.CustomerId
WHERE strftime('%Y', invoices.InvoiceDate) = '2009'
GROUP BY employees.EmployeeId
ORDER BY TotalVendido DESC
LIMIT 1;

'''

df = sql_query(query)
df

        Empleado  TotalVendido
0  Steve Johnson        164.34

In [26]:
#  9. ¿Cuáles son los 3 grupos que más han vendido?

query = '''
SELECT artists.Name AS Grupo,
       SUM(invoice_items.UnitPrice * invoice_items.Quantity) AS TotalVendido
FROM artists
JOIN albums ON artists.ArtistId = albums.ArtistId
JOIN tracks ON albums.AlbumId = tracks.AlbumId
JOIN invoice_items ON tracks.TrackId = invoice_items.TrackId
GROUP BY artists.ArtistId
ORDER BY TotalVendido DESC
LIMIT 3;

'''

df = sql_query(query)
df

         Grupo  TotalVendido
0  Iron Maiden        138.60
1           U2        105.93
2    Metallica         90.09